backend/views/datosacademicos/_form.php

SELECT * FROM `tipotitulo`
---
use kartik\widgets\DatePicker;
use wbraganca\dynamicform\DynamicFormWidget;

$Tipotitulo=Tipotitulo::find()->all();

SELECT * FROM `funcionario`
---

            <div class="col-sm-6">

                 <?= $form->field($model, 'id_funcionario', ['labelOptions'=>['style'=>'color:green']] )->widget(Select2::classname(), [
                    'data' => ArrayHelper::map(Funcionario::find()->all(), 'id_funcionario', 'fullName'),
                    'language' => 'es',
                    'pluginOptions' => ['highlight'=>true],
                    'options' => ['placeholder' => 'Seleccione funcionario...'],
                    'pluginOptions' => [
                        'allowClear' => true
                    ],
                ]);