backend/views/labordocente/_form.php

SELECT * FROM `programa`
SELECT * FROM `modulo`
SELECT * FROM `semestre`
SELECT * FROM `jornada`
---
use kartik\builder\Form;
use wbraganca\dynamicform\DynamicFormWidget;

$Programa=Programa::find()->all();
$listDataprograma=ArrayHelper::map($Programa,'id_programa','programa');
$Modulo=Modulo::find()->all();
$listDatamodulo=ArrayHelper::map($Modulo,'id_modulo','modulo');
$Semestre=Semestre::find()->all();
$listDatasemestre=ArrayHelper::map($Semestre,'id_semestre','semestre');
$Jornada=Jornada::find()->all();

SELECT * FROM `funcionario` WHERE `estado`=1 ORDER BY `nombres`
---

            <div class="col-sm-6">

                 <?= $form->field($model, 'id_funcionario', ['labelOptions'=>['style'=>'color:green']] )->widget(Select2::classname(), [
                    'data' => ArrayHelper::map(Funcionario::find()->where(['estado'=>1])->orderBy('nombres')->all(), 'id_funcionario', 'fullName'),
                    'language' => 'es',
                    'pluginOptions' => ['highlight'=>true],
                    'options' => ['placeholder' => 'Seleccione funcionario...'],
                    'pluginOptions' => [
                        'allowClear' => true
                    ],
                ]);

SELECT * FROM `tipotitulo`
---

            <div class="col-sm-6">

                 <?= $form->field($model, 'id_tipotitulo', ['labelOptions'=>['style'=>'color:green']] )->widget(Select2::classname(), [
                    'data' => ArrayHelper::map(Tipotitulo::find()->asArray()->all(), 'id_tipotitulo', 'tipotitulo'),
                    'language' => 'es',
                    'pluginOptions' => ['highlight'=>true],
                    'options' => ['placeholder' => 'Seleccione título...'],
                    'pluginOptions' => [
                        'allowClear' => true
                    ],
                ]);

SELECT * FROM `facultad` ORDER BY `facultad`
---

            <div class="col-sm-6">

                 <?= $form->field($model, 'id_facultad', ['labelOptions'=>['style'=>'color:green']] )->widget(Select2::classname(), [
                    'data' => ArrayHelper::map(Facultad::find()->orderBy('facultad')->asArray()->all(), 'id_facultad', 'facultad'),
                    'language' => 'es',
                    'pluginOptions' => ['highlight'=>true],
                    'options' => ['placeholder' => 'Seleccione facultad...'],
                    'pluginOptions' => [
                        'allowClear' => true
                    ],
                ]);

SELECT * FROM `periodoacademico` ORDER BY `periodo`
---

             <div class="col-sm-6">

                 <?= $form->field($model, 'id_periodo_academico', ['labelOptions'=>['style'=>'color:green']] )->widget(Select2::classname(), [
                    'data' => ArrayHelper::map(Periodoacademico::find()->orderBy('periodo')->asArray()->all(), 'id_periodo_academico', 'periodo'),
                    'language' => 'es',
                    'pluginOptions' => ['highlight'=>true],
                    'options' => ['placeholder' => 'Seleccione periodo académico...'],
                    'pluginOptions' => [
                        'allowClear' => true
                    ],
                ]);