backend/views/labordocente/_search.php

SELECT * FROM `periodoacademico`
SELECT * FROM `funcionario`
SELECT * FROM `facultad`
SELECT * FROM `programa`
---
        'method' => 'get',
    ]); ?>

    <?= $form->field($model, 'id_periodo_academico')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Periodoacademico::find()->all(), 'id_periodo_academico', 'periodo'),
        'language' => 'es',
        'options' => ['placeholder' => 'Seleccione título...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]);

    ?>

    <?= $form->field($model, 'id_funcionario', ['labelOptions'=>['style'=>'color:orange']])->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Funcionario::find()->all(), 'id_funcionario', 'fullName'),
        'language' => 'es',
        'options' => ['placeholder' => 'Seleccione funcionario...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]);

    ?>

    <?= $form->field($model, 'id_facultad')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Facultad::find()->all(), 'id_facultad', 'facultad'),
        'language' => 'es',
        'options' => ['placeholder' => 'Seleccione Facultad...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]);

    ?>

    <?= $form->field($model, 'id_programa')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Programa::find()->all(), 'id_programa', 'programa'),
        'language' => 'es',
        'options' => ['placeholder' => 'Seleccione programa...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]);