backend/views/labordocente/index.php

                    return $model->tipotitulo->vr_hora;
                },
                'filterType'=>GridView::FILTER_SELECT2,
                'filter'=>ArrayHelper::map(Tipotitulo::find()->orderBy('vr_hora')->asArray()->all(), 'id_tipotitulo', 'vr_hora'),
---
SELECT * FROM `tipotitulo` ORDER BY `vr_hora`