backend/views/funcionario/_search.php

        'method' => 'get',
    ]); ?>

     <?= $form->field($model, 'id_funcionario')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Funcionario::find()->all(), 'id_funcionario', 'fullName'),
        'language' => 'es',
        'options' => ['placeholder' => 'Seleccione tipo funcionario...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]);

    ?>

    <?= $form->field($model, 'id_tipo_funcionario')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Tipofuncionario::find()->all(), 'id_tipo_funcionario', 'tipo_funcionario'),
        'language' => 'es',
        'options' => ['placeholder' => 'Seleccione tipo funcionario...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]);
---
SELECT * FROM `funcionario`
SELECT * FROM `tipofuncionario`