backend/views/laborcontratista/_search.php


    <?php // echo $form->field($model, 'id_tipotitulo') ?>

    <?= $form->field($model, 'id_funcionario')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Funcionario::find()->all(), 'id_funcionario', 'fullName'),
        'language' => 'es',
        'options' => ['placeholder' => 'Seleccione funcionario...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]);
---
SELECT * FROM `funcionario`