backend/views/laboradicional/_search.php

SELECT * FROM `funcionario`
---
    <div class="panel-body">


   <?= $form->field($model, 'id_funcionario')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Funcionario::find()->all(), 'id_funcionario', 'fullName'),
        'language' => 'es',
        'options' => ['placeholder' => 'Seleccione funcionario...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]);

SELECT * FROM `tipotitulo`
SELECT * FROM `facultad`
---
    ?>


   <?= $form->field($model, 'id_tipotitulo')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Tipotitulo::find()->all(), 'id_tipotitulo', 'tipotitulo'),
        'language' => 'es',
        'options' => ['placeholder' => 'Seleccione título...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]);

    ?>

    <?= $form->field($model, 'id_facultad')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Facultad::find()->all(), 'id_facultad', 'facultad'),
        'language' => 'es',
        'options' => ['placeholder' => 'Seleccione facultad...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]);