backend/models/Area.php

SELECT * FROM `area`
---
    public static  function  get_area(){
          $ar = Area::find()->all();