backend/models/Banco.php

SELECT * FROM `banco`
---
    public static  function  get_banco(){
          $ar = Banco::find()->all();