backend/models/Cargo.php

    public static  function  get_cargo(){
          $ar = Cargo::find()->all();
---
SELECT * FROM `cargo`