backend/models/Estadocivil.php

    public static  function  get_estadocivil(){
          $ar = Estadocivil::find()->all();
---
SELECT * FROM `estadocivil`