backend/models/Facultad.php

    public static  function  get_facultad(){
          $cat = Facultad::find()->all();
---
SELECT * FROM `facultad`