backend/models/Fondosalud.php

    public static  function  get_fsalud(){
          $fs = Fondosalud::find()->all();
---
SELECT * FROM `fondosalud`