backend/models/Fondopensiones.php

    public static  function  get_fpensiones(){
          $ar = Fondopensiones::find()->all();
---
SELECT * FROM `fondopensiones`