backend/models/Funcionario.php

SELECT * FROM `funcionario`
---
    public static  function  get_funcionario(){
          $func = Funcionario::find()->all();

SELECT * FROM `funcionario`
---
    public static  function  get_funcionarioApe(){
          $ap = Funcionario::find()->all();