backend/models/Genero.php

SELECT * FROM `genero`
---
    public static  function  get_genero(){
          $gen = Genero::find()->all();