backend/models/Jornada.php

    public static  function  get_jornada(){
          $cat = Jornada::find()->all();
---
SELECT * FROM `jornada`