backend/models/Modulo.php

     public static  function  get_modulo(){
          $ar = Modulo::find()->all();
---
SELECT * FROM `modulo`