backend/models/Periodoacademico.php

SELECT * FROM `periodoacademico`
---
    public static  function  get_pacademico(){
          $cat = Periodoacademico::find()->all();