backend/models/Programa.php

    public static  function  get_programa(){
          $ar = Programa::find()->all();
---
SELECT * FROM `programa`