backend/models/Semestre.php

SELECT * FROM `semestre`
---
     public static  function  get_semestre(){
          $ar = Semestre::find()->all();