backend/models/Tipotitulo.php

SELECT * FROM `tipotitulo`
---
    public static  function  get_tipotitulo(){
          $ar = Tipotitulo::find()->all();