backend/models/Tipofuncionario.php

    public static  function  get_tfuncionario(){
          $ar = Tipofuncionario::find()->all();
---
SELECT * FROM `tipofuncionario`