backend/views/datosfamiliares/_form.php

//use yii\bootstrap\ActiveForm;
use wbraganca\dynamicform\DynamicFormWidget;

$Genero=Genero::find()->all();
---
SELECT * FROM `genero`


            <div class="col-sm-6">

                 <?= $form->field($model, 'id_funcionario', ['labelOptions'=>['style'=>'color:green']] )->widget(Select2::classname(), [
                    'data' => ArrayHelper::map(Funcionario::find()->all(), 'id_funcionario', 'fullName'),
                    'language' => 'es',
                    'pluginOptions' => ['highlight'=>true],
                    'options' => ['placeholder' => 'Seleccione funcionario...'],
                    'pluginOptions' => [
                        'allowClear' => true
                    ],
                ]);
---
SELECT * FROM `funcionario`